<?php
namespace app\model\helper;
use app\model\User;
use app\model\Chat;
use core\dc\DC;
class Generator
{
	public static function GenLogin()
	{
		$t = ['pa', 'la', 'dra', 'co', 'jo', 'ak', 'ab', 'de', 'la', 'lo', 'ma', 'don', 'na', 'jack', 'tra', 'hyd', 'met', 'ro', 'or', 'gan', 'ge', 'to', 'a', 'an', 'pre', 'thro', 'us', 'tu'];
		$l = rand(2, 8);
		$m = '';
		for($i = 0; $i < $l; ++$i)
		{
			
			$m .= $t[rand(0, count($t) - 1)];
		}
		return $m;
	}
	public static function GenNoun($gender)
	{
		$name1 = ['двор', 'завод', 'фестиваль', 'стол', 'учитель', 'человек', 'калькулятор', 'зверь', 'телефон', 'апельсин', 'хлеб', 'мыслитель'];
		$name2 = ['женщина', 'лошадь', 'малина', 'вишня', 'панда', 'стрела', 'метла', 'почта', 'реклама', 'цель', 'лиса', 'птица'];
		$name3 = ['море', 'поле', 'пшено', 'молоко', 'веретено', 'копье', 'колье', 'ателье', 'звено', 'полотно', 'зеркало', 'лото', 'облако', 'крыло'];
		$name4 = ['ножницы', 'спицы', 'растения', 'краски', 'занавески', 'люди', 'дома', 'звенья', 'дороги', 'пути', 'поля', 'ветра', 'года'];
		if($gender == 1)
			return $name1[rand(0, count($name1) - 1)];
		if($gender == 2)
			return $name2[rand(0, count($name2) - 1)];
		if($gender == 3)
			return $name3[rand(0, count($name3) - 1)];
		if($gender == 4)
			return $name4[rand(0, count($name4) - 1)];
		return '';
	}
	public static function GenAdjective($gender)
	{
		$nameO = ['гробов', 'густ', 'записн', 'зл', 'коренн', 'крут', 'миров', 'неземн', 'нем', 'обложн', 'площадн', 'проливн', 'сед', 'слеп', 'сплошн', 'чертов', 'штормов'];
		$nameI = ['волч', 'впечатляющ', 'всепоглощающ', 'всесторонн', 'высок', 'гигантск', 'гомерическ', 'громк', 'дик', 'дремуч', 'жестк', 'жутк', 'зверск', 'излишн', 'изуверск', 'исполинск', 'исчерпывающ', 'катастрофическ', 'кричащ', 'мертвецк', 'могуч', 'наибольш', 'настоящ', 'нечеловеческ', 'олимпийск', 'ошеломляющ', 'подавляющ', 'полнейш', 'последн', 'пронизывающ', 'раздирающ', 'разящ', 'редк', 'резк', 'сатанинск', 'собач', 'строг', 'сущ', 'теляч', 'трескуч', 'тяжк', 'ужасающ', 'уничтожающ', 'фантастическ', 'хорош', 'широк', 'щемящ', 'ярк'];
		$nameY = ['абсолютн', 'азартн', 'активн', 'баснословн', 'безапелляционн', 'безбожн', 'безбрежн', 'безвозвратн', 'безграничн', 'бездонн', 'бездушн', 'безжалостн', 'беззаветн', 'беззастенчив', 'безмерн', 'безмятежн', 'безнадежн', 'безоговорочн', 'безотлагательн', 'безраздельн', 'безрассудн', 'безропотн', 'безудержн', 'безукоризненн', 'безумн', 'безупречн', 'безусловн', 'безустанн', 'безутешн', 'безысходн', 'белоснежн', 'бескомпромиссн', 'бесконечн', 'беспардонн', 'бесповоротн', 'беспощадн', 'беспредельн', 'беспрекословн', 'беспрецедентн', 'беспримерн', 'беспробудн', 'беспроглядн', 'беспросветн', 'беспросыпн', 'бессовестн', 'бесстыдн', 'бесценн', 'бесчеловечн', 'бесчисленн', 'бесшабашн', 'бешен', 'богат', 'буйн', 'бурн', '', 'внушительн', 'возмутительн', 'громадн', 'груб', 'дивн', 'доскональн', 'дотошн', 'жизненн', 'завидн', 'закадычн', 'заклят', 'законченн', 'закоренел', 'заядл', 'зверин', 'значительн', 'идеальн', 'исключительн', 'истов', 'истошн', 'кардинальн', 'колоссальн', 'кромешн', 'кругл', 'крупн', 'лют', 'максимальн', 'массов', 'мастит', 'матер', 'махров', 'мощн', 'мучительн', 'набит', 'нагл', 'наглядн', 'надежн', 'надрывн', 'настоятельн', 'небывал', 'невероятн', 'невиданн', 'невозможн', 'невообразим', 'невосполним', 'невыносим', 'невыразим', 'недопустим', 'недосягаем', 'недюжинн', 'незабываем', 'незаурядн', 'неизмерим', 'неимоверн', 'неиссякаем', 'неистов', 'неистощим', 'неистребим', 'неисходн', 'неисчерпаем', 'неисчислим', 'немаловажн', 'немал', 'немилосердн', 'ненасытн', 'необорим', 'необузданн', 'необыкновенн', 'необычайн', 'неограниченн', 'неодолим', 'неописуем', 'неопровержим', 'неоспорим', 'неотразим', 'неоценим', 'непередаваем', 'непереносим', 'непобедим', 'неповторим', 'непогрешим', 'неподдельн', 'непоколебим', 'непомерн', 'непоправим', 'непостижим', 'непревзойденн', 'непреоборим', 'непреодолим', 'непререкаем', 'непримирим', 'непробиваем', 'непробудн', 'непроглядн', 'непролазн', 'непроходим', 'неразрывн', 'нерасторжим', 'несгибаем', 'несказанн', 'неслыханн', 'несметн', 'несмолкаем', 'несмываем', 'несокрушим', 'несравненн', 'нестерпим', 'несусветн', 'неудержим', 'неуемн', 'неуклонн', 'неукоснительн', 'неукротим', 'неумеренн', 'неустанн', 'неусыпн', 'неутешн', 'неутолим', 'неутомим', 'нещадн', 'обильн', 'оглушительн', 'огромн', 'ожесточенн', 'ослин', 'основательн', 'остервенел', 'остр', 'отборн', 'откровенн', 'открыт', 'отличн', 'отменн', 'отпет', 'отчаянн', 'отъявленн', 'перв', 'пламенн', 'плотн', 'поголовн', 'подчеркнут', 'поразительн', 'порядочн', 'преклонн', 'преступн', 'приличн', 'принципиальн', 'прирожденн', 'прожженн', 'разгромн', 'революционн', 'решительн', 'рьян', 'свинцов', 'свиреп', 'серьезн', 'сильн', 'смертн', 'сногсшибательн', 'сокрушительн', 'солидн', 'страстн', 'страшн', 'существенн', 'тяжел', 'убежденн', 'убийственн', 'уважительн', 'удивительн', 'умопомрачительн', 'филигранн', 'форменн', 'фундаментальн', 'чрезвычайн', 'чрезмерн', 'чудовищн', 'шквальн', 'щедр', 'экстремальн', 'ювелирн', 'ядрен', 'ярый'];
		$cnt = count($nameO) + count($nameI) + count($nameY);
		$name = ['сложн', 'зелен', 'ветрен', 'малинов', 'светл', 'черн', 'опасн', 'добр', 'весел', 'быстр', 'бел', 'железн', 'красн'];
		$r = rand(0, $cnt - 1);
		$n = [];
		$end = ['ой', 'ая', 'ое', 'ые'];
		$res = '';
		if($r < count($nameO))
		{
			$n = $nameO;
			$res = $n[$r] . $end[$gender - 1];
		}
		else if($r < count($nameO) + count($nameI))
		{
			$r -= count($nameO);
			$n = $nameI;
			$end = ['ий', 'ая', 'ее', 'ие'];
			if(mb_substr($n[$r], mb_strlen($n[$r]) - 1)) == 'ч')
				$end = ['ий', 'ья', 'ье', 'ие'];
			if(mb_substr($n[$r], mb_strlen($n[$r]) - 1)) == 'к')
				$end = ['ий', 'ая', 'ое', 'ие'];
			$res = $n[$r] . $end[$gender - 1];
		}
		else
		{
			$r -= count($nameO) + count($nameI);
			$n = $nameY;
			$end = ['ый', 'ая', 'ое', 'ые'];
			$res = $n[$r] . $end[$gender - 1];
		}
		return $res;
	}
	public static function GenerateUsers($count = 20)
	{
		for($i = 0; $i < $count; ++$i)
			User::Create(mb_convert_case(static::GenLogin(), MB_CASE_TITLE, "UTF-8"), time() . '_' . $i . '@mail.ru', '123');
	}
	public static function GenerateChats($count = 20)
	{
		for($i = 0; $i < $count; ++$i)
		{
			$g = random_int(1, 4);
			$n = mb_convert_case(static::GenAdjective($g), MB_CASE_TITLE, "UTF-8") . ' ' . static::GenNoun($g);
			$and = random_int(0, 2);
			if($and == 0)
				$n .= ' и ' . static::GenAdjective($g) . ' ' . static::GenNoun($g);
			Chat::Create($n, 1);
		}
	}
	public static function Clear()
	{
		Chat::DeleteWhere();
		User::DeleteWhere('id != 1');
	}
}